english_lectures = [
    {
        'id': 102,
        'title': 'cool english',
        'video_id': 'BAACAgIAAxkBAAIB1GYQCcNPkDMzwYGQy3iwDuaobbh8AALvRwACNAABgEhpSoOrm9mutzQE',
        'pdf_id': 'BQACAgIAAxkBAAIB3WYQC3vBdqQf_zBbu4XvWftqcXZSAAIdSAACNAABgEgk_UaYmmFT0TQE',
        'text': 'engleeeeeesh',
        'test_id': 1,
        'lab_id': 1,
    },
    {
        'id': 103,
        'title': 'history english',
        'text': 'История английского языка чрезвычайно интересна и насыщена различными влияниями.Английский язык берёт своё начало от германских диалектов, которые пришли с англосаксами, переселившимися на Британские острова в 5-7 веках н.э. Затем английский язык стал сильно влияться латинским и французским языками, в частности, в период нормандского завоевания Англии в 1066 году.В период Ренессанса английский язык стал богатеть за счет заимствования слов и фраз из латыни и греческого языков. В последующие столетия английский язык продолжал развиваться, усваивая влияние различных культур и языков.',
        'test_id': 2,
        'lab_id': 2,
    },
    {
        'id': 104,
        'title': 'famous english people',
        'text': '1. Уильям Шекспир – великий драматург и поэт, родоначальник английской литературы.\n2. Уинстон Черчилль – выдающийся политик, премьер-министр Великобритании во времена Второй мировой войны.\n3. Исаак Ньютон – физик, математик и астроном, создатель законов движения и теории гравитации.',
        'test_id': 3,
        'lab_id': 3,
    },
]