math_lectures = [
    {
        'id': 2,
        'title': 'linear algebra',
        'video_id': 'BAACAgIAAxkBAAIB0mYQCbvTA4BHZ3nffDd5Ja5njxkUAALqRwACNAABgEimLHITL_33izQE',
        'pdf_id': 'BQACAgIAAxkBAAIB22YQC2TfcoxtYAhP3lzSmV7UNYfEAAIZSAACNAABgEjHzLawTLWQCTQE',
        'text': 'Линейная алгебра - это раздел математики, изучающий векторные пространства, линейные отображения и их свойства. Этот раздел математики широко применяется в науке, инженерии, информатике и других областях.Основные понятия линейной алгебры включают векторы, линейные комбинации, линейные уравнения, матрицы, определители, собственные значения и собственные векторы. Одной из ключевых задач линейной алгебры является решение систем линейных уравнений, а также нахождение собственных значений и собственных векторов линейных преобразований.Линейная алгебра также находит применение в других областях математики, таких как математический анализ, дифференциальные уравнения, теория вероятностей и статистика. Она играет важную роль в построении моделей и решении различных задач, связанных с линейными системами и преобразованиями.',
        'test_id': 8,
        'lab_id': 8,
    },
    {
        'id': 3,
        'title': 'matrix algebra',
        'text': 'Теория матриц является одной из важных частей линейной алгебры и математики в целом. Матрица представляет собой прямоугольную таблицу чисел, расположенных в виде строк и столбцов. Она играет ключевую роль в решении систем линейных уравнений, представлении линейных отображений и операций над векторами.В теории матриц изучаются различные операции с матрицами, такие как сложение матриц, умножение матрицы на число, умножение матрицы на матрицу, нахождение обратной матрицы, транспонирование матрицы и многое другое. Эти операции имеют важное практическое применение в решении задач из различных областей, таких как физика, экономика, информатика и т.д.Важным понятием в теории матриц является определитель матрицы, который позволяет определить, является ли матрица обратимой, а также решить систему линейных уравнений. Собственные значения и собственные векторы матриц также являются важными понятиями, которые применяются в различных математических и физических моделях.',
        'test_id': 9,
        'lab_id': 9,
    },
    {
        'id': 5,
        'title': 'derivative',
        'text': 'Теория производной является одной из фундаментальных частей математического анализа и имеет широкие практические применения в различных областях науки и техники. Производная функции вводится как понятие, характеризующее скорость изменения функции в данной точке.Производная функции f(x) в точке x=a, обозначаемая f\'(a) или df/dx|_(x=a), равна пределу отношения приращения функции к приращению аргумента при стремлении приращения аргумента к нулю. Формально это можно записать как f\'(a) = lim (h->0) [f(a+h) - f(a)] / h.Основные свойства производной включают формулы дифференцирования элементарных функций (например, для суммы, разности, произведения и частного функций), правило дифференцирования сложной функции (цепное правило), а также правило дифференцирования обратной функции.',
        'test_id': 10,
        'lab_id': 10,
    },
]
