program_lecture = [
    {
        'id': 23,
        'title': 'hardcore programming',
        'video_id': 'BAACAgIAAxkBAAIB1mYQCciO4tkYIDcUKWIFWkWZnpTEAALyRwACNAABgEieBn2vGX59xDQE',
        'pdf_id': 'BQACAgIAAxkBAAIB32YQC5SWVKzloPqFFcSp8IkKAqXCAAIhSAACNAABgEiMDmTWEW-6aTQE',
        'test_id': 5,
        'lab_id': 5,
    },
    {
        'id': 24,
        'title': 'computer science',
        'text': 'Теория компьютерных наук (или computer science) – это область, изучающая основные принципы, теории, методы и техники, лежащие в основе разработки программного обеспечения, компьютерных систем и информационных технологий.Эта дисциплина охватывает широкий спектр тем, включая:\n1. Алгоритмы и структуры данных: изучение эффективных методов организации и обработки информации.\n2. Теория вычислений: изучение возможностей и ограничений компьютеров, формализация понятия вычислимости.\n3. Языки программирования и компиляторы: исследования по созданию новых языков программирования и разработка инструментов для их трансляции в машинный код.',
        'test_id': 6,
        'lab_id': 6,
    },
    {
        'id': 25,
        'title': 'best language',
        'text': 'Вопрос о лучшем языке программирования зависит от конкретной задачи, для выполнения которой вам нужен этот язык программирования. Вот несколько популярных языков программирования и области их применения:\n1. Python - отлично подходит для разработки веб-приложений, научных вычислений, обработки данных и многих других областей благодаря своей чистоте, простоте и разнообразию библиотек.\n2. JavaScript - широко используется в веб-разработке для создания интерактивных веб-страниц и веб-приложений.\n3. Java - популярен в корпоративной среде для создания больших масштабных приложений и игр.',
        'test_id': 7,
        'lab_id': 7,
    },

]